content/quick-ref.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-27 Thu 23:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>L-System Explorer Quick Guide</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">L-System Explorer Quick Guide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org982b924">1. Modules</a>
<ul>
<li><a href="#org2063609">1.1. Turtle Motion</a></li>
<li><a href="#org81e5db0">1.2. Turtle Orientation</a></li>
<li><a href="#org01fa066">1.3. Turtle Settings</a></li>
<li><a href="#orgc54ecc7">1.4. Turtle Geometry</a></li>
<li><a href="#orgde217cc">1.5. L-system Geometry and Control</a></li>
</ul>
</li>
<li><a href="#orgc17e4ab">2. L-System Syntax</a>
<ul>
<li><a href="#org4b8d6c6">2.1. Comments</a></li>
<li><a href="#org2bd2382">2.2. Defines</a></li>
<li><a href="#org96d2d81">2.3. Settings</a></li>
<li><a href="#org5216aef">2.4. Expressions</a></li>
</ul>
</li>
<li><a href="#org85955fb">3. UI and controls</a>
<ul>
<li><a href="#org72a16a7">3.1. Turtle controls</a></li>
<li><a href="#org732dc67">3.2. Scene Controls</a></li>
<li><a href="#orga58b835">3.3. L-system controls</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org982b924" class="outline-2">
<h2 id="org982b924"><span class="section-number-2">1.</span> Modules</h2>
<div class="outline-text-2" id="text-1">
<p class="verse">
Why are they called modules and not commands or something else?<br />
Because module is an old term used by botanists for a unit of<br />
growth (article in French from the Latin for branch and<br />
translated to module in English.)<br />
<br />
Modules marked <b>u</b> are <b>unimplemented</b><br />
Modules marked <b>p</b> are <b>partially implemented</b><br />
Modules marked <b>c</b> are <b>changed from TABOP/cpfg</b><br />
Modules marked <b>n</b> are <b>new for this implementation</b><br />
</p>
</div>

<div id="outline-container-org2063609" class="outline-3">
<h3 id="org2063609"><span class="section-number-3">1.1.</span> Turtle Motion</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Without a parameter move 'step' amount
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">F(d)</td>
<td class="org-left">move d units w/pen down, records track point</td>
</tr>

<tr>
<td class="org-left">f(d)</td>
<td class="org-left">move d units w/pen up, records track point</td>
</tr>

<tr>
<td class="org-left">G(d)</td>
<td class="org-left"><code>==</code> F(d), but does not record track points</td>
</tr>

<tr>
<td class="org-left">g(d)</td>
<td class="org-left"><code>==</code> f(d), w/o recording track points</td>
</tr>

<tr>
<td class="org-left">@[Mm](x,y,z)</td>
<td class="org-left">goto position, 'M' draw or 'm' don't draw</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org81e5db0" class="outline-3">
<h3 id="org81e5db0"><span class="section-number-3">1.2.</span> Turtle Orientation</h3>
<div class="outline-text-3" id="text-1-2">
<p class="verse">
The turtle maintains three unit vectors, heading (<b>H</b>), left (<b>L</b>), and up (<b>U</b>).<br />
The turtle home orientation is <b>H</b> = +x, <b>L</b> = +z, and <b>U</b> = +y,<br />
but L-system Explorer pitches up 90 degrees, initially, so <b>H</b> points +y and <b>L</b> points -x.<br />
<br />
A positive yaw (left) rotates <b>H</b> towards <b>L</b> around <b>U</b>.<br />
A positive pitch (down) rotates <b>U</b> towards <b>H</b> around <b>L</b>.<br />
A positive roll rotates <b>L</b> towards <b>U</b> around <b>H</b>.<br />
<br />
Without a parameter, a turn is 'delta' degrees; default is 90.<br />
<br />
<b>Note</b> We make the turtle behave as if it were in a right-handed system, but all the<br />
underlying Babylonjs is left-handed. This has some odd consequences when comparing<br />
models with TABOP. (If I'd known I could just tell Babylonjs to use a RHS, things<br />
would have been simpler.)<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">+(a)</td>
<td class="org-left">yaw left a degrees</td>
</tr>

<tr>
<td class="org-left">-(a)</td>
<td class="org-left">yaw right degrees</td>
</tr>

<tr>
<td class="org-left">&amp;(a)</td>
<td class="org-left">pitch down a degrees</td>
</tr>

<tr>
<td class="org-left">^(a)</td>
<td class="org-left">pitch up a degrees</td>
</tr>

<tr>
<td class="org-left">\(a)</td>
<td class="org-left">roll left a degrees</td>
</tr>

<tr>
<td class="org-left">/(a)</td>
<td class="org-left">roll right a degrees</td>
</tr>

<tr>
<td class="org-left">&vert;</td>
<td class="org-left">yaw 180 degrees</td>
</tr>

<tr>
<td class="org-left">@v</td>
<td class="org-left">roll so U is parallel to up [y]</td>
</tr>

<tr>
<td class="org-left">@R(hx,hy,hz[,ux,uy,uz])</td>
<td class="org-left">set heading to [hx,hy,hz]</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">set U parallel to [ux,uy,z], if supplied</td>
</tr>

<tr>
<td class="org-left">@H(h)               <b>n</b></td>
<td class="org-left">set turtle to home position and orientation,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">if optional h is not 0, then set H to +x,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">otherwise, H is +y. Does not draw or record point</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org01fa066" class="outline-3">
<h3 id="org01fa066"><span class="section-number-3">1.3.</span> Turtle Settings</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Defaults without a parameter to one
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">;(i)</td>
<td class="org-left">increase or set color/material index</td>
</tr>

<tr>
<td class="org-left">,(i)</td>
<td class="org-left">decrease or set color/material index</td>
</tr>

<tr>
<td class="org-left">@;(n)</td>
<td class="org-left">increase or set back face color/material index</td>
</tr>

<tr>
<td class="org-left">@,(n)</td>
<td class="org-left">decrease or set back face color/material index</td>
</tr>

<tr>
<td class="org-left">#(n)</td>
<td class="org-left">increase or set line width</td>
</tr>

<tr>
<td class="org-left">!(n)</td>
<td class="org-left">decrease or set line width</td>
</tr>

<tr>
<td class="org-left">@Tx(n) <b>u</b></td>
<td class="org-left">set texture index</td>
</tr>

<tr>
<td class="org-left">@D(s) <b>u</b></td>
<td class="org-left">set scale factor of subsequent geometry</td>
</tr>

<tr>
<td class="org-left">@Di(f) <b>u</b></td>
<td class="org-left">multiply scale factor by f</td>
</tr>
</tbody>
</table>
</div>
</div>
