content/quick-ref.org
** Turtle Geometry
| @o(d)            | circle of diameter d, centered at turtle position                 |
| @C(d) *u*        | circle of diameter d in HL plane                                  |
| @O(d)            | sphere of diameter d                                              |
| ~(S,s) *c*       | insert predefined surface S, with optional scale, s               |
| @Ds(n[,t]) *n*   | start contour with n final pts. t = 0 => open(default), 1 = closed  |
| @De(id) *n*      | end contour and save it as id (number or string)                  |
| @Da(t[,a]) *n*   | if t=0, create arc between previous 3 pts                         |
|                  | if t=1, create arc from previous two points, w/ctr at p0,         |
|                  | start at p1, with angle a                                         |
| @Dt(m1,m2) *n*   | create Hermite spline from previous two points, with optional |
|                  | length multipliers m1 and m2                                            |
| @Db              | Create a cubic Bezier spline segment from prior four points       |
| @Dm(m) *n*       | create contour of multiplicity m, default 1, only if closed type  |
| @#(id)           | set contour(id) as current track shape                            |
| {                | start polygon                                                     |
| }(n,S)           | end polygon of type n (possibly empty), optional save as mesh S   |
| {(0)  *c*        | start path with stepwise control pts, not polygon                 |
| {(1)             | start open path with Hermite spline control pts                   |
| {(2) *u*         | start closed path with Hermite spline control pts                 |
| {(3) *u*         | start open path with B-spline control pts                         |
| {(4) *u*         | start closed path with B-spline control pts                       |
| }[(id)] *p*      | end current path of any type and extrude contour, With            |
|                  | parameter, id, save path as mesh                                  |
| @Gs              | start Hermite spline path, same as '{(1).', i.e. saves point      |
| @Ge(n,id) *c*    | close path started with @Gs. if n, set # intermediate points.     |
|                  | If 'id', save extrusion as mesh                                   |
| .                | add current position to path, polygon, or contour                 |
| @Gt(m1,m2)       | Set tangent length multipliers - default is 1.2                   |
| @Gr(a1,l1,a2,l2) | Set slope and length of tangent vectors for radius curve          |
| @Gc(n)       *p* | Store control point. Optionally set number of interpolated strips |


** L-system Geometry and Control
| [               | start branch, pushing state onto stack    |
| ]               | end branch, popping branch state stack    |
| % *p*           | cut modules to end of branch              |
| $(id,scale) *c* | push current Lsystem and use sub-Lsystem id   |
| $               | end current sub-Lsystem, return to previous  |
  
* L-System Syntax
** Comments
   C-style comments, '/​* stuff, including newline */​' are supported.\\
   Single-line '//' style comments are not - they conflict with L-system syntax.
** Defines
   Lines that start with '#define macro value', 'macro' being some word, create
standard C-style macros where 'macro' is replaced with 'value' in 
the L-system before parsing starts.
** Settings
   Before the axiom is specified, variables can be set for the L-system. 
The following variables can be set to control default/initial L-system values, 
using standard syntax, i.e. var = value. Multiple settings on the same line must be
separated by a semi-colon.\\
   Note that the view setting is a JS object with the properties
'position' and 'target', whose values are JS arrays of X,Y,Z coordinates.
| stemsize | width of extrusion. default: 0.1                               |
| delta    | angle in degrees of yaw, pitch, and roll. default: 90          |
| step     | distance traveled by F,f,G,g modules. default: 1               |
| view     | position: 3D position of viewer/camera.                        |
|          | target: 3D position of view/camera target.                     |
|          | e.g. view = {position: [20,20,5], target: [0,8,0]}             |
|          | --- or ---                                                     |
|          | auto: direction                                                |
|          | where direction is one of X, -X, Y, -Y, Z, -Z, or              |
|          | a direction array defining where the camera position should    |
|          | be. The target is always the center of the bounding sphere     |
|          | of the drawn geometry and the distance from the target is      |
|          | twice the radius of the bounding sphere.                       |
|          | e.g. view = {auto: y} will look down on the XY plane. Note,    |
|          | case-insensitivity. Or,                                        |
|          | view = {auto: [1,1,1]} will place the camera on a line through |
|          | the target center parallel to the vector 1,1,1, looking at the |
|          | target                                                         |
|          | The default view is {auto: X}                                  |

   In addition, variables used in the L-system can be set and used in the L-system; they 
shouldn't conflict with any module parameters.
** Expressions
   Expressions occur in tests, parameters, and pre/post test *u*. They 
follow mathjs syntax: [[https://mathjs.org/docs/expressions/syntax.html][Expression syntax for mathjs]].

  Of particular note, are the logical operators which must be written explicitly as
| and | instead of '&&'|
| or | instead of '\vert\vert' |
| not | instead of '!' |
   e.g. (t > 0) and not u
