content/quick-ref.html

<div id="outline-container-orgc54ecc7" class="outline-3">
<h3 id="orgc54ecc7"><span class="section-number-3">1.4.</span> Turtle Geometry</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">@o(d)</td>
<td class="org-left">circle of diameter d, centered at turtle position</td>
</tr>

<tr>
<td class="org-left">@C(d) <b>u</b></td>
<td class="org-left">circle of diameter d in HL plane</td>
</tr>

<tr>
<td class="org-left">@O(d)</td>
<td class="org-left">sphere of diameter d</td>
</tr>

<tr>
<td class="org-left">~(S,s) <b>c</b></td>
<td class="org-left">insert predefined surface S, with optional scale, s</td>
</tr>

<tr>
<td class="org-left">@Ds(n[,t]) <b>n</b></td>
<td class="org-left">start contour with n final pts. t = 0 =&gt; open(default), 1 = closed</td>
</tr>

<tr>
<td class="org-left">@De(id) <b>n</b></td>
<td class="org-left">end contour and save it as id (number or string)</td>
</tr>

<tr>
<td class="org-left">@Da(t[,a]) <b>n</b></td>
<td class="org-left">if t=0, create arc between previous 3 pts</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">if t=1, create arc from previous two points, w/ctr at p0,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">start at p1, with angle a</td>
</tr>

<tr>
<td class="org-left">@Dt(m1,m2) <b>n</b></td>
<td class="org-left">create Hermite spline from previous two points, with optional</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">length multipliers m1 and m2</td>
</tr>

<tr>
<td class="org-left">@Db</td>
<td class="org-left">Create a cubic Bezier spline segment from prior four points</td>
</tr>

<tr>
<td class="org-left">@Dm(m) <b>n</b></td>
<td class="org-left">create contour of multiplicity m, default 1, only if closed type</td>
</tr>

<tr>
<td class="org-left">@#(id)</td>
<td class="org-left">set contour(id) as current track shape</td>
</tr>

<tr>
<td class="org-left">{</td>
<td class="org-left">start polygon</td>
</tr>

<tr>
<td class="org-left">}(n,S)</td>
<td class="org-left">end polygon of type n (possibly empty), optional save as mesh S</td>
</tr>

<tr>
<td class="org-left">{(0)  <b>c</b></td>
<td class="org-left">start path with stepwise control pts, not polygon</td>
</tr>

<tr>
<td class="org-left">{(1)</td>
<td class="org-left">start open path with Hermite spline control pts</td>
</tr>

<tr>
<td class="org-left">{(2) <b>u</b></td>
<td class="org-left">start closed path with Hermite spline control pts</td>
</tr>

<tr>
<td class="org-left">{(3) <b>u</b></td>
<td class="org-left">start open path with B-spline control pts</td>
</tr>

<tr>
<td class="org-left">{(4) <b>u</b></td>
<td class="org-left">start closed path with B-spline control pts</td>
</tr>

<tr>
<td class="org-left">}[(id)] <b>p</b></td>
<td class="org-left">end current path of any type and extrude contour, With</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">parameter, id, save path as mesh</td>
</tr>

<tr>
<td class="org-left">@Gs</td>
<td class="org-left">start Hermite spline path, same as '{(1).', i.e. saves point</td>
</tr>

<tr>
<td class="org-left">@Ge(n,id) <b>c</b></td>
<td class="org-left">close path started with @Gs. if n, set # intermediate points.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">If 'id', save extrusion as mesh</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">add current position to path, polygon, or contour</td>
</tr>

<tr>
<td class="org-left">@Gt(m1,m2)</td>
<td class="org-left">Set tangent length multipliers - default is 1.2</td>
</tr>

<tr>
<td class="org-left">@Gr(a1,l1,a2,l2)</td>
<td class="org-left">Set slope and length of tangent vectors for radius curve</td>
</tr>

<tr>
<td class="org-left">@Gc(n)       <b>p</b></td>
<td class="org-left">Store control point. Optionally set number of interpolated strips</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgde217cc" class="outline-3">
<h3 id="orgde217cc"><span class="section-number-3">1.5.</span> L-system Geometry and Control</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">[</td>
<td class="org-left">start branch, pushing state onto stack</td>
</tr>

<tr>
<td class="org-left">]</td>
<td class="org-left">end branch, popping branch state stack</td>
</tr>

<tr>
<td class="org-left">% <b>p</b></td>
<td class="org-left">cut modules to end of branch</td>
</tr>

<tr>
<td class="org-left">$(id,scale) <b>c</b></td>
<td class="org-left">push current Lsystem and use sub-Lsystem id</td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">end current sub-Lsystem, return to previous</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgc17e4ab" class="outline-2">
<h2 id="orgc17e4ab"><span class="section-number-2">2.</span> L-System Syntax</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4b8d6c6" class="outline-3">
<h3 id="org4b8d6c6"><span class="section-number-3">2.1.</span> Comments</h3>
<div class="outline-text-3" id="text-2-1">
<p>
C-style comments, '/​* stuff, including newline */​' are supported.<br />
Single-line '//' style comments are not - they conflict with L-system syntax.
</p>
</div>
</div>
<div id="outline-container-org2bd2382" class="outline-3">
<h3 id="org2bd2382"><span class="section-number-3">2.2.</span> Defines</h3>
<div class="outline-text-3" id="text-2-2">
<p>
   Lines that start with '#define macro value', 'macro' being some word, create
standard C-style macros where 'macro' is replaced with 'value' in 
the L-system before parsing starts.
</p>
</div>
</div>
<div id="outline-container-org96d2d81" class="outline-3">
<h3 id="org96d2d81"><span class="section-number-3">2.3.</span> Settings</h3>
<div class="outline-text-3" id="text-2-3">
<p>
   Before the axiom is specified, variables can be set for the L-system. 
The following variables can be set to control default/initial L-system values, 
using standard syntax, i.e. var = value. Multiple settings on the same line must be
separated by a semi-colon.<br />
   Note that the view setting is a JS object with the properties
'position' and 'target', whose values are JS arrays of X,Y,Z coordinates.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">stemsize</td>
<td class="org-left">width of extrusion. default: 0.1</td>
</tr>

<tr>
<td class="org-left">delta</td>
<td class="org-left">angle in degrees of yaw, pitch, and roll. default: 90</td>
</tr>

<tr>
<td class="org-left">step</td>
<td class="org-left">distance traveled by F,f,G,g modules. default: 1</td>
</tr>

<tr>
<td class="org-left">view</td>
<td class="org-left">position: 3D position of viewer/camera.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">target: 3D position of view/camera target.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e.g. view = {position: [20,20,5], target: [0,8,0]}</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2014; or ---</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">auto: direction</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">where direction is one of X, -X, Y, -Y, Z, -Z, or</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a direction array defining where the camera position should</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">be. The target is always the center of the bounding sphere</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">of the drawn geometry and the distance from the target is</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">twice the radius of the bounding sphere.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e.g. view = {auto: y} will look down on the XY plane. Note,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">case-insensitivity. Or,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">view = {auto: [1,1,1]} will place the camera on a line through</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the target center parallel to the vector 1,1,1, looking at the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">target</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">The default view is {auto: X}</td>
</tr>
</tbody>
</table>

<p>
   In addition, variables used in the L-system can be set and used in the L-system; they 
shouldn't conflict with any module parameters.
</p>
</div>
</div>
<div id="outline-container-org5216aef" class="outline-3">
<h3 id="org5216aef"><span class="section-number-3">2.4.</span> Expressions</h3>
<div class="outline-text-3" id="text-2-4">
<p>
   Expressions occur in tests, parameters, and pre/post test <b>u</b>. They 
follow mathjs syntax: <a href="https://mathjs.org/docs/expressions/syntax.html">Expression syntax for mathjs</a>.
</p>

<p>
Of particular note, are the logical operators which must be written explicitly as
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">and</td>
<td class="org-left">instead of '&amp;&amp;'</td>
</tr>

<tr>
<td class="org-left">or</td>
<td class="org-left">instead of '&vert;&vert;'</td>
</tr>

<tr>
<td class="org-left">not</td>
<td class="org-left">instead of '!'</td>
</tr>
</tbody>
</table>
<p>
e.g. (t &gt; 0) and not u
</p>
</div>
</div>
</div>
