content/quick-ref.org
* UI and controls
  - subject to constant change -
** Turtle controls
  At the top are the turtle controls. To the right of the label, "Turtle Controls" is a widget
  that will expand and collapse the controls. The first expansion is a buttonbar that controls the
  default turtle. If you open the Javascript console, you can directly enter Turtle3d commands to get 
  an idea for how it works. You can also turn on the Gen Code mode to get examples of how the turtle 
  is used. 

 - *Hide/Show* will hide or show the turtle shape, which is a mini axis of the HLU system of the turtle.
 - *Clear* will clear all the geometry generated by the turtle(s).
 - *Home* moves the turtle back to 0,0,0 and orients it along the axes.
 - *Reset* is the same as *Clear* and *Home*
 - *Look at Turtle* orients the camera so the turtle is in the center of view.
 - *Show/Hide Color Table* displays the current color/material table
 - *>* is a widget to expand a table that shows the position and heading of the turtle
** Scene Controls   
   Here you can toggle visibility of the Ground, Sky, and coordinate axes
** L-system controls
  Below the Turtle controls are the L-system controls. There is a link to this *Quick Ref*erence.
  The buttonbar and controls below that display and manipulate the lsystem and rendering of it.
  Since you need an L-system to use these, you can enter one manually in the text area below the Browse
  button, or use the Browse button to find a local L-system file. [Details later]

 - *Parse* this button will parse whatever text is in the L-system source area and show the result in the
   L-Ssytem Expansion text box. If you make changes to the L-system, choose this first.
 - *Rewrite* will rewrite the parsed L-system, and, again, place the result in the L-system Expansion box.
 - *Draw* will interpret the expanded system and draw the geometry on the canvas. Note, that *Draw* neither
  clears, homes, or resets any previously drawn geometry.
 - *Reset-and-Draw* will clear, and reset the turtle before drawing. It does not re-parse.
 - *Step* will do one interation step of the the L-system, no matter how many interations are specified in
  the L-system spec. As a special case, if the *Parse* button is used to clear and reparse the L-system, 
 - *Step* will initially write and interpret the axiom; subsequent steps will clear the previous geometry,
  rewrite one step of the L-system, and redraw it. This can be informative when multi-turtle mode is on and
  the draw speed is set low.
 - *MultiTurtle?* is a checkbox to turn this mode on/off. When on, the interpretation/drawing creates a new
  turtle for each branch and then gives each turtle one step on its branch in a round-robin draw mode. When
  a turtle reaches the end of the branch it is destroyed. This mode typically appears more natural.

 - *Choose File* allows you to load an lsystem locally. It is a text file, typically with a .ls extension
 - *Save* allows you to save the L-system

  Below the L-system source box are status and more controls:
 - *L-system status:* |X|Y|Z| , where X is the number of iterations/expansions of the axiom; Y is the number
  of modules in the L-system expansion, and Z is the number of modules that have been interpreted/drawn. This
  last box will turn green when drawing is complete.
 - *Draw Speed* is an input to control the drawing speed in modules/frame. It defaults to 200 and runs from
  1 to 500. Higher rates tend to bog down the browser.
 - *Save Mesh* allows you to save draw geometry to a GLTF file.
 - *Gen Code* causes the interpretation to generate the turtle code that it uses to draw the geometry. This 
  is simpler in single turtle mode.
 - *Save Code* allows you to save that generated code.
-----

