content/quick-ref.html
<div id="outline-container-org85955fb" class="outline-2">
<h2 id="org85955fb"><span class="section-number-2">3.</span> UI and controls</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>subject to constant change -</li>
</ul>
</div>
<div id="outline-container-org72a16a7" class="outline-3">
<h3 id="org72a16a7"><span class="section-number-3">3.1.</span> Turtle controls</h3>
<div class="outline-text-3" id="text-3-1">
<p>
At the top are the turtle controls. To the right of the label, "Turtle Controls" is a widget
that will expand and collapse the controls. The first expansion is a buttonbar that controls the
default turtle. If you open the Javascript console, you can directly enter Turtle3d commands to get 
an idea for how it works. You can also turn on the Gen Code mode to get examples of how the turtle 
is used. 
</p>

<ul class="org-ul">
<li><b>Hide/Show</b> will hide or show the turtle shape, which is a mini axis of the HLU system of the turtle.</li>
<li><b>Clear</b> will clear all the geometry generated by the turtle(s).</li>
<li><b>Home</b> moves the turtle back to 0,0,0 and orients it along the axes.</li>
<li><b>Reset</b> is the same as <b>Clear</b> and <b>Home</b></li>
<li><b>Look at Turtle</b> orients the camera so the turtle is in the center of view.</li>
<li><b>Show/Hide Color Table</b> displays the current color/material table</li>
<li><b>&gt;</b> is a widget to expand a table that shows the position and heading of the turtle</li>
</ul>
</div>
</div>
<div id="outline-container-org732dc67" class="outline-3">
<h3 id="org732dc67"><span class="section-number-3">3.2.</span> Scene Controls</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Here you can toggle visibility of the Ground, Sky, and coordinate axes
</p>
</div>
</div>
<div id="outline-container-orga58b835" class="outline-3">
<h3 id="orga58b835"><span class="section-number-3">3.3.</span> L-system controls</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Below the Turtle controls are the L-system controls. There is a link to this *Quick Ref*erence.
The buttonbar and controls below that display and manipulate the lsystem and rendering of it.
Since you need an L-system to use these, you can enter one manually in the text area below the Browse
button, or use the Browse button to find a local L-system file. [Details later]
</p>

<ul class="org-ul">
<li><b>Parse</b> this button will parse whatever text is in the L-system source area and show the result in the
L-Ssytem Expansion text box. If you make changes to the L-system, choose this first.</li>
<li><b>Rewrite</b> will rewrite the parsed L-system, and, again, place the result in the L-system Expansion box.</li>
<li><b>Draw</b> will interpret the expanded system and draw the geometry on the canvas. Note, that <b>Draw</b> neither
clears, homes, or resets any previously drawn geometry.</li>
<li><b>Reset-and-Draw</b> will clear, and reset the turtle before drawing. It does not re-parse.</li>
<li><b>Step</b> will do one interation step of the the L-system, no matter how many interations are specified in
the L-system spec. As a special case, if the <b>Parse</b> button is used to clear and reparse the L-system,</li>
<li><b>Step</b> will initially write and interpret the axiom; subsequent steps will clear the previous geometry,
rewrite one step of the L-system, and redraw it. This can be informative when multi-turtle mode is on and
the draw speed is set low.</li>
<li><b>MultiTurtle?</b> is a checkbox to turn this mode on/off. When on, the interpretation/drawing creates a new
turtle for each branch and then gives each turtle one step on its branch in a round-robin draw mode. When
a turtle reaches the end of the branch it is destroyed. This mode typically appears more natural.</li>

<li><b>Choose File</b> allows you to load an lsystem locally. It is a text file, typically with a .ls extension</li>
<li><p>
<b>Save</b> allows you to save the L-system
</p>

<p>
Below the L-system source box are status and more controls:
</p></li>
<li><b>L-system status:</b> |X|Y|Z| , where X is the number of iterations/expansions of the axiom; Y is the number
of modules in the L-system expansion, and Z is the number of modules that have been interpreted/drawn. This
last box will turn green when drawing is complete.</li>
<li><b>Draw Speed</b> is an input to control the drawing speed in modules/frame. It defaults to 200 and runs from
1 to 500. Higher rates tend to bog down the browser.</li>
<li><b>Save Mesh</b> allows you to save draw geometry to a GLTF file.</li>
<li><b>Gen Code</b> causes the interpretation to generate the turtle code that it uses to draw the geometry. This 
is simpler in single turtle mode.</li>
<li><b>Save Code</b> allows you to save that generated code.</li>
</ul>
<hr />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-27 Thu 23:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
